# У компании имеется следующий склад (см. рис), три ряда стеллажей, стоящие в ряд
# по 700 ед. Каждый стеллаж содержит 5 полок. Каждая полка содержит 6 ячеек. Между
# рядами стеллажей есть проходы. Между стеллажами в одном ряду проходов нет.
# Ширина полок одинакова и равна ширине прохода. Зеленым цветом обозначены
# проходы.
# Кладовщику выдается случайный перечень ячеек, из которых требуется взять товар.
# Помогите составить маршрут передвижения кладовщика по складу, начиная движение
# от стола, таким образом, чтобы он затратил минимально возможный путь.


1. Предствать маршрут в виде графа, у которого все ребра равны и неотрицательны.
2. Применить поиск в глубину для получения всех возможных маршрутов до заданной точки.
3. Выбрать кратчайший маршрут.

